INSERT INTO
  library
VALUES
  /* 九州・沖縄->8 */
  (1, "久留米市立中央図書館"),
  (2, "鳥栖市立図書館"),
  (3, "みやき町立図書館"),
  (4, "福岡市立中央図書館"),
  /* 四国->7 */
  (5, "土佐町立図書館"),
  (6, "三島図書館"),
  (7, "須崎市立図書館"),
  /* 中国->6 */
  (8, "島根県立図書館"),
  (9, "広島市まんが図書館"),
  (10, "岡山県立図書館"),
  /* 近畿->5 */
  (11, "国立国会図書館"),
  (12, "京都府立図書館"),
  (13, "池田市立図書館"),
  /* 中部->4 */
  (14, "金沢海みらい図書館"),
  (15, "愛知県図書館"),
  (16, "富山市立図書館"),
  /* 関東->3 */
  (17, "海老名市立中央図書館"),
  (18, "江東区立江東図書館"),
  (19, "小山市立中央図書館"),
  /* 東北->2 */
  (20, "青森県立図書館"),
  (21, "五戸町図書館"),
  (22, "岩手県立図書館"),
  /* 北海道->1 */
  (23, "北海道立図書館"),
  (24, "札幌市中央図書館"),
  (25, "釧路市中央図書館");