/* 25 データ作る */
INSERT INTO book
VALUES
  (NULL, "ガイコツ書店員本田さん", "本田", "KADOKAWA", "978-4040681566", 1, 8, 1),
  (NULL, "小説の神様", "相沢 沙呼", "講談社", "978-4062940344", 3, 8, 1),
  (NULL, "檸檬の棘", "黒木 渚", "講談社", "978-4065177549", 4, 1, 1),
  (NULL, "僕が愛したすべての君へ", "乙野 四方字", "早川書房", "B01HLPJK70", 3, 8, 1),
  (NULL, "蟹の形", "大今良時", "講談社", "978-4063949735", 3, 8, 1),
  (NULL, "のび太の新恐竜", "藤子・F・ 不二雄", "小学館", "978-4091431639", 3, 8, 1),
  (NULL, "宇宙小説", "辻村 深月、福田 和代", "講談社", "978-4062772341", 3, 8, 1),
  (NULL, "この恋は世界でいちばん...", "宇山 圭佑", "集英社", "978-4087711684", 3, 8, 1),
  --ここまで
  (NULL, "大延長", "相沢 沙呼", "講談社", "978-4062940344", 3, 8, 1),
  (NULL, "小説の神様", "相沢 沙呼", "講談社", "978-4062940344", 3, 8, 1),
  (NULL, "小説の神様", "相沢 沙呼", "講談社", "978-4062940344", 3, 8, 1),
  (NULL, "小説の神様", "相沢 沙呼", "講談社", "978-4062940344", 3, 8, 1),
  (NULL, "小説の神様", "相沢 沙呼", "講談社", "978-4062940344", 3, 8, 1),
  (NULL, "小説の神様", "相沢 沙呼", "講談社", "978-4062940344", 3, 8, 1),
  (NULL, "小説の神様", "相沢 沙呼", "講談社", "978-4062940344", 3, 8, 1),
  (NULL, "小説の神様", "相沢 沙呼", "講談社", "978-4062940344", 3, 8, 1),
  (NULL, "小説の神様", "相沢 沙呼", "講談社", "978-4062940344", 3, 8, 1),
  (NULL, "小説の神様", "相沢 沙呼", "講談社", "978-4062940344", 3, 8, 1),
  (NULL, "小説の神様", "相沢 沙呼", "講談社", "978-4062940344", 3, 8, 1),
  (NULL, "小説の神様", "相沢 沙呼", "講談社", "978-4062940344", 3, 8, 1),
  (NULL, "小説の神様", "相沢 沙呼", "講談社", "978-4062940344", 3, 8, 1),
  (NULL, "小説の神様", "相沢 沙呼", "講談社", "978-4062940344", 3, 8, 1),
  (NULL, "小説の神様", "相沢 沙呼", "講談社", "978-4062940344", 3, 8, 1),
  (NULL, "小説の神様", "相沢 沙呼", "講談社", "978-4062940344", 3, 8, 1),
  (NULL, "小説の神様", "相沢 沙呼", "講談社", "978-4062940344", 3, 8, 1);

